<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    "accepted" => "يجب قبول هذا الحقل.",
    "accepted_if" => "يجب قبول هذا الحقل في حالة :other يساوي :value.",
    "active_url" => "لا يُمثّل رابطًا صحيحًا.",
    "after" => "يجب أن يكون تاريخًا لاحقًا للتاريخ :date.",
    "after_or_equal" => "يجب أن يكون تاريخاً لاحقاً أو مطابقاً للتاريخ :date.",
    "alpha" => "يجب أن لا يحتوي سوى على حروف.",
    "alpha_dash" => "يجب أن لا يحتوي سوى على حروف، أرقام ومطّات.",
    "alpha_num" => "يجب أن يحتوي على حروفٍ وأرقامٍ فقط.",
    "array" => "يجب أن يكون مصفوفة.",
    "ascii" => "يجب أن يحتوي هذا الحقل فقط على أحرف أبجدية رقمية أحادية البايت ورموز.",
    "attached" => "هذا الحقل تم إرفاقه بالفعل.",
    "before" => "يجب أن يكون تاريخًا سابقًا للتاريخ :date.",
    "before_or_equal" => "يجب أن يكون تاريخا سابقا أو مطابقا للتاريخ :date.",
    "between" => [
        "array" => "يجب أن يحتوي على عدد من العناصر بين :min و :max.",
        "file" => "يجب أن يكون حجم الملف بين :min و :max كيلوبايت.",
        "numeric" => "يجب أن تكون القيمة بين :min و :max.",
        "string" => "يجب أن يكون عدد حروف النّص بين :min و :max."
    ],
    "boolean" => "يجب أن تكون قيمة هذا الحقل إما true أو false .",
    "can" => "هذا الحقل يحتوي على قيمة غير مصرّح بها.",
    "confirmed" => "التأكيد غير متطابق.",
    "contains" => "هذا الحقل يفتقد قيمة مطلوبة.",
    "date" => "هذا ليس تاريخًا صحيحًا.",
    "date_equals" => "يجب أن يكون تاريخاً مطابقاً للتاريخ :date.",
    "date_format" => "لا يتوافق مع الشكل :format.",
    "decimal" => "يجب أن يحتوي هذا الحقل على :decimal منزلة/منازل عشرية.",
    "declined" => "يجب رفض هذه القيمة.",
    "declined_if" => "يجب رفض هذه القيمة في حالة :other هو :value.",
    "different" => "يجب أن تكون القيمة مختلفة عن :other.",
    "digits" => "يجب أن يحتوي على :digits رقمًا/أرقام.",
    "digits_between" => "يجب أن يكون بين :min و :max رقمًا/أرقام .",
    "dimensions" => "الصورة تحتوي على أبعاد غير صالحة.",
    "distinct" => "هذا الحقل يحمل قيمة مُكرّرة.",
    "doesnt_end_with" => "هذا الحقل يجب ألّا ينتهي بأحد القيم التالية: :values.",
    "doesnt_start_with" => "هذا الحقل يجب ألّا يبدأ بأحد القيم التالية: :values.",
    "email" => "يجب أن يكون عنوان بريد إلكتروني صحيح البُنية.",
    "ends_with" => "يجب أن ينتهي بأحد القيم التالية: :values",
    "enum" => "القيمة المحددة غير موجودة في قائمة القيم المسموح بها.",
    "exists" => "القيمة المحددة غير موجودة.",
    "extensions" => "يجب أن يحتوي هذا الحقل على أحد الإمتدادات التالية: :values.",
    "file" => "المحتوى يجب أن يكون ملفا.",
    "filled" => "هذا الحقل إجباري.",
    "gt" => [
        "array" => "يجب أن يحتوي على أكثر من :value عناصر/عنصر.",
        "file" => "يجب أن يكون حجم الملف أكبر من :value كيلوبايت.",
        "numeric" => "يجب أن تكون القيمة أكبر من :value.",
        "string" => "يجب أن يكون طول النّص أكثر من :value حروفٍ/حرفًا."
    ],
    "gte" => [
        "array" => "يجب أن يحتوي على الأقل على :value عُنصرًا/عناصر.",
        "file" => "يجب أن يكون حجم الملف على الأقل :value كيلوبايت.",
        "numeric" => "يجب أن تكون القيمة مساوية أو أكبر من :value.",
        "string" => "يجب أن يكون طول النص على الأقل :value حروفٍ/حرفًا."
    ],
    "hex_color" => "يجب أن يحتوي هذا الحقل على صيغة لون HEX صالحة.",
    "image" => "يجب أن تكون صورةً.",
    "in" => "القيمة المحددة غير موجودة في قائمة القيم المسموح بها.",
    "in_array" => "هذه القيمة غير موجودة في :other.",
    "integer" => "يجب أن يكون عددًا صحيحًا.",
    "ip" => "يجب أن يكون عنوان IP صحيحًا.",
    "ipv4" => "يجب أن يكون عنوان IPv4 صحيحًا.",
    "ipv6" => "يجب أن يكون عنوان IPv6 صحيحًا.",
    "json" => "يجب أن يكون نصًا من نوع JSON.",
    "list" => "يجب أن يكون هذا الحقل قائمة.",
    "lowercase" => "يجب أن يحتوي الحقل على حروف صغيرة.",
    "lt" => [
        "array" => "يجب أن يحتوي على أقل من :value عناصر/عنصر.",
        "file" => "يجب أن يكون حجم الملف أصغر من :value كيلوبايت.",
        "numeric" => "يجب أن تكون القيمة أصغر من :value.",
        "string" => "يجب أن يكون طول النّص أقل من :value حروفٍ/حرفًا."
    ],
    "lte" => [
        "array" => "يجب أن لا يحتوي على أكثر من :value عناصر/عنصر.",
        "file" => "يجب أن لا يتجاوز حجم الملف :value كيلوبايت.",
        "numeric" => "يجب أن تكون القيمة مساوية أو أصغر من :value.",
        "string" => "يجب أن لا يتجاوز طول النّص :value حروفٍ/حرفًا."
    ],
    "mac_address" => "يجب أن تكون القيمة عنوان MAC صالحاً.",
    "max" => [
        "array" => "يجب أن لا يحتوي على أكثر من :max عناصر/عنصر.",
        "file" => "يجب أن لا يتجاوز حجم الملف :max كيلوبايت.",
        "numeric" => "يجب أن تكون القيمة مساوية أو أصغر من :max.",
        "string" => "يجب أن لا يتجاوز طول النّص :max حروفٍ/حرفًا."
    ],
    "max_digits" => "يجب ألا يحتوي هذا الحقل على أكثر من :max رقم/أرقام.",
    "mimes" => "يجب أن يكون ملفًا من نوع : :values.",
    "mimetypes" => "يجب أن يكون ملفًا من نوع : :values.",
    "min" => [
        "array" => "يجب أن يحتوي على الأقل على :min عُنصرًا/عناصر.",
        "file" => "يجب أن يكون حجم الملف على الأقل :min كيلوبايت.",
        "numeric" => "يجب أن تكون القيمة مساوية أو أكبر من :min.",
        "string" => "يجب أن يكون طول النص على الأقل :min حروفٍ/حرفًا."
    ],
    "required" => "هذا الحقل مطلوب.",
    "unique" => "هذه القيمة مُستخدمة من قبل.",
    "url" => "الصيغة غير صحيحة.",
    "uuid" => "يجب أن يكون بصيغة UUID سليمة.",



    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
